cases/windTunnelCar/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// eps ≈ Cmu^0.75 * k^1.5 / Lt  (Lt ~ 0.07 * tunnel half-height)
dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.25;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.25;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.25;
        value           uniform 0.25;
    }
    ground
    {
        type            epsilonWallFunction;
        value           uniform 0.25;
    }
    top
    {
        type            zeroGradient;
    }
    side1
    {
        type            zeroGradient;
    }
    side2
    {
        type            zeroGradient;
    }
    vehicle
    {
        type            epsilonWallFunction;
        value           uniform 0.25;
    }
}

// ************************************************************************* //
