cases/windTunnelCar/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

car.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    writeObj            yes;
}

// ************************************************************************* //
