cases/windTunnelCar/Allrun
#!/usr/bin/env bash
# Wind tunnel with Khronos CarConcept body (scaled ~4.2 m)
set -euo pipefail
CASE_DIR="$(cd "$(dirname "${BASH_SOURCE[0]}")" && pwd)"
cd "$CASE_DIR"

if [[ -z "${WM_PROJECT_DIR:-}" ]]; then
    if [[ -x /usr/bin/openfoam2512 ]]; then
        exec /usr/bin/openfoam2512 -c "cd '$CASE_DIR' && bash ./Allrun"
    fi
    echo "ERROR: OpenFOAM env not loaded"
    exit 1
fi

echo "OpenFOAM ${WM_PROJECT_VERSION}  case=$CASE_DIR  (CarConcept STL + RAS)"

bash ./Allclean >/dev/null 2>&1 || true

if [[ ! -f constant/triSurface/car.stl ]]; then
    echo "ERROR: missing constant/triSurface/car.stl"
    exit 1
fi
for f in 0/U 0/p 0/k 0/epsilon 0/nut; do
    [[ -f "$f" ]] || { echo "missing $f"; exit 1; }
done

echo "==> blockMesh"
blockMesh > log.blockMesh 2>&1

echo "==> surfaceFeatureExtract (optional skip if fails)"
surfaceFeatureExtract > log.surfaceFeatureExtract 2>&1 || true

echo "==> snappyHexMesh (car.stl)"
snappyHexMesh -overwrite > log.snappyHexMesh 2>&1

echo "==> checkMesh"
checkMesh > log.checkMesh 2>&1 || true

echo "==> simpleFoam"
simpleFoam > log.simpleFoam 2>&1

echo "Done. Times:"; ls -d [0-9]* 2>/dev/null | tail -8 || true
touch case.foam
echo "ParaView: $CASE_DIR/case.foam"
